import { Image, Main } from "../assets/style/SinglePage.style";
import BeraneIMG from "../assets/images/berane.jpg";
import Centar from "../assets/images/centar.jpg";
import SinglePageNav from "../components/SinglePageNav";
import SinglePageHeader from "../components/SinglePageHeader";

const Berane = () => {
  const bodyHeader = [
    `Беране се налази у источном дијелу Црне Горе и захвата сјеверни дио Горњег Полимља. Према југу граничи се са Андријевицом, према истоку граница се налази на планинама Мокра, Мургаш, Цмиљевица, Турјак и падина Цмиљевице према општини Рожаје. Према сјеверу граница се налази иза Полице са општином Петњица и општином Бијело Поље. Западна граница општине се налази на највишим врховима Бјеласице, Стрменица, Црна Глава, Зекова Глава и падина Кључа, према општинама Мојковац и Колашин.`,
    `На најнижој надморској висини налази се долина Лима, низводно од Тивранске клисуре, на 640 метара, а на највисочијој Црна Глава на Бјеласици на 2.139 метара. Беранска котлина се пружа у дужини од 9 километара, ширине 3 до 5 километара. Средином котлине протиче ријека Лим, којa представља значајан привредни хидропотенцијал општине.`,
    `Поред Лима хидрографску мрежу чине бројни водотоци, језера, извори и врела. Међу њима се издвајају глечерска језера: Пешића језеро, Велико и Мало Урсуловачко језеро, Велико и Мало Шишко језеро која употпуњују прелијепи пејзаж Бјеласице и дају јој посебну драж.`,
  ];

  return (
    <>
      <SinglePageNav />
      <SinglePageHeader title="O Beranama" body={bodyHeader} />
      <Main>
        <article>
          <p>
            О богатој историјској прошлости Берана свједоче бројна налазишта и
            локалитети још из времена 4000 година прије нове ере, као што су:
            Беранкрш, Петњик, Ржаница, Градац, Рудеш, Лужац, Долац, Будимља,
            Луге, Заграђе, Јасиковац... Бројни налази говоре да је данашње
            подручје Берана било насељено још у неолитско доба и доба Илира.
          </p>
          <p>
            У средњем вијеку подручје Берана је било познато као Будимља. Било
            је од великог економског, религиозног политичког знајача у српској
            земљи Рашкој. Мноштво манастира и цркава у близини града свједоче о
            богатом духовном животу тадашњих Срба. У Беранама се налази
            задужбина Немањића Ђурђеви Ступови.
          </p>
          <p>
            На мјесту гдје се данас налази, до 1862. године није било ниједне
            куће. Послије битке на Рудешу за потребе турске војске подигнуто
            војно упориште. Насеље се споро ширило јер се православно
            становништво нерадо одлучивао да подиже домове поред турског логора.
            Беране је као градско насеље формирано у другој половини XIX вијека,
            тачније 1862. године по заповједи турског војсковође Хусеин-паше. Он
            је наредио војсци да се на лијевој обали Лима, на мјесту гдје се
            данас налази општа болница, подигне камена касарна за потребе војне
            управе.
          </p>
          <p>
            Насеље је почело брзо да се шири, а на десној обали Лима на
            Просинама настало је друго насеље у подножју брда Јасиковац, гдје су
            становали турски официри ислужбеници са бројним женама у харемима.
            По тим харемима је дио вароши назван Хареме. Турци су на Јасиковцу
            изградили тврђаву и мост на Лиму.
          </p>
          <p>
            Током вијекова Горње Полимље је више пута мијењало име. О поријеклу
            назива Беране постоје различита и подијељена мишљена. Једни сматрају
            да је још у XIV вијеку настало Берансело, које је током вијекова
            урасло у градско језгро, те да је од тога касније и градско насеље
            добило име Беране. По мишљењу проф. др. Милисава Лутовца назив
            Беране је настало од турске ријечи Бир-хане, што у пријеводу значи
            једна кућа. Беране је ослобођено од турске власти у Првом балканском
            рату, 16. октобра 1912. године када је црногорска војска ушла у
            град.
          </p>
          <p>
            Од јула 1949. до марта 1992. године град је носио име Иванград, по
            народном хероју Ивану Милутиновићу (1901-1944).
          </p>
        </article>
        <article>
          <img src={BeraneIMG} alt="OPSTINA BERANE" />
        </article>
      </Main>
      <Image>
        <img src={Centar} alt="Centar" />
        <p>
          На подручју општине Беране живи 28.488 становника, од чега је 14.238
          жена или 49,98% и 14.250 мушкараца или 50,02 %. У урбаном градском
          језгру живи 11.073, у приградским насељима 13.055, а у руралним
          подручјима 4.360 становника. Овај податак најбоље одсликава
          несразмјеру у насељености општине Беране.
        </p>
        <p>
          Попут већине општина на сјеверу Црне Горе и Беране биљежи тренд
          преласка становништва из села у градско језгро. Поред тога, одсељавање
          становништва, углавном млађе популације, све је израженије што је
          посљедица лоше економске ситуације и потраге за послом. Додатни
          проблем представља све нижа стопа природног прираштаја која је у
          руралним подручјима на историјском минимуму. За посљедицу имамо
          забрињавајућу старосну структуру становништва, што потврђују званични
          статистички подаци.
        </p>
      </Image>
    </>
  );
};

export default Berane;
